app/Http/Controllers/CategoriasController.php

    public function index()
    {
        // Aquí puedes obtener las categorías de la base de datos y pasarlas a la vista
        $categorias = Categoria::paginate(5); // Obtener todas las categorías y paginarlas
---
select * from "categorias" limit 5 offset 0
select count(*) as aggregate from "categorias"