app/Http/Controllers/HomeController.php

select * from "categorias" where "categorias"."id" in (2, 3, 4)
select * from "libros" limit 5 offset 0
select count(*) as aggregate from "libros"
select count(*) as aggregate from "libros" where "estatus" = 1
select count(*) as aggregate from "users"
select count(*) as aggregate from "prestamos" where "estado" = 'pendiente'
---
    public function index()
    {
        $user = auth()->user();

        if ($user->user_type === 'admin') {
            $libros = Libro::with('categoria')->paginate(5);
            $total_libros = Libro::count();
            $libros_pestados = Libro::where('estatus', 1)->count();
            $total_usuarios = User::count();
            $devoluciones_pendientes = Prestamo::where('estado', 'pendiente')->count();