app/Http/Controllers/HomeController.php

select * from "libros" limit 2 offset 0
---
    public function index()
    {

        $user = auth()->user();
        if ($user->user_type === 'admin') {

        $libros = Libro::paginate(2);