app/Http/Controllers/LibrosController.php

select * from "categorias" where "categorias"."id" in (2, 3, 4)
select * from "libros" order by "id" desc limit 5 offset 0
select count(*) as aggregate from "libros"
select count(*) as aggregate from "libros" where "estatus" = 1
select count(*) as aggregate from "users"
select count(*) as aggregate from "prestamos" where "estado" = 'pendiente'
---
    public function index()
    {
        $libros = Libro::with('categoria')->orderBy('id', 'desc')->paginate(5);
        $total_libros = Libro::count();
        $libros_pestados = Libro::where('estatus', 1)->count();
        $total_usuarios = User::count();
        $devoluciones_pendientes = Prestamo::where('estado', 'pendiente')->count();