app/Http/Controllers/LibrosController.php

    public function index()
{
        $libros = Libro::with('categoria')->orderBy('id', 'desc')->paginate(2);
---
select * from "libros" order by "id" desc limit 2 offset 0