app/Http/Controllers/PrestamosController.php

    public function index()
    {
        $prestamos = Prestamo::with('usuario', 'libro')->get();
---
select * from "libros" where "libros"."id" in (1, 2, 4)
select * from "prestamos"