app/Http/Controllers/UsuariosController.php

select * from "users" limit 10 offset 0
select count(*) as aggregate from "users"
---
    public function index()
    {
        $usuarios = User::paginate(10);

update "users" set "name" = 'Alexis Eduardo Hernandez', "updated_at" = '2026-04-18 22:35:12' where "id" = 2
---
    public function updateProfile(Request $request)
    {
        $usuario = Auth::user();

        $data = $request->validate([
            'nombre' => 'required|string|max:255',
        ]);

        $usuario->name = $data['nombre'];
        $usuario->save();